#### 1. Converting Strings to Uppercase

In [1]:
words = ["hello", "world", "python"]
uppercase_words = [word.upper() for word in words]
uppercase_words

['HELLO', 'WORLD', 'PYTHON']

#### 2. Filtering Non-Divisible Numbers

In [2]:
nums = range(20)
divisible_by_three = [n for n in nums if n % 3 == 0]
divisible_by_three

[0, 3, 6, 9, 12, 15, 18]

#### 3. Combining Two Lists into Tuples

In [3]:
list1 = [1, 2, 3]
list2 = ['a', 'b', 'c']
combined = [(num, letter) for num in list1 for letter in list2]
combined

[(1, 'a'),
 (1, 'b'),
 (1, 'c'),
 (2, 'a'),
 (2, 'b'),
 (2, 'c'),
 (3, 'a'),
 (3, 'b'),
 (3, 'c')]

#### 4. Flattening a List of Lists

In [4]:
nested_list = [[1, 2], [3, 4], [5, 6]]
flat_list = [item for sublist in nested_list for item in sublist]
flat_list

[1, 2, 3, 4, 5, 6]

#### 5. Advanced Example: Creating a Matrix

In [5]:
matrix = [[1 if item_idx == row_idx else 0 for item_idx in range(3)] for row_idx in range(3)]
matrix

[[1, 0, 0], [0, 1, 0], [0, 0, 1]]

#### 6. Use List Comprehension in a DataFrame

In [6]:
import pandas as pd

#Create a dataframe
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eve   45      Phoenix

In [7]:
df['Age_Group'] = ['Youth' if age < 30 else 'Adult' if age <= 45 else 'Senior' for age in df['Age']]
df

      Name  Age         City Age_Group
0    Alice   25     New York     Youth
1      Bob   30  Los Angeles     Adult
2  Charlie   35      Chicago     Adult
3    David   40      Houston     Adult
4      Eve   45      Phoenix     Adult

In [8]:
# Implement it in a function

def categorize_age_groups(df: pd.DataFrame, age_column: str) -> pd.DataFrame:
    """
    Categorize each entry into age groups based on the age column.
    dataframe: DataFrame containing the age data.
    age_column: The column name in the DataFrame that contains age data.

    Returns: A new DataFrame with an added 'Age_Group' column.
    """
    if age_column not in df.columns:
        raise ValueError(f"Column '{age_column}' not found in the DataFrame")

    df['Age_Group'] = [
        'Youth' if age < 30 else 'Adult' if age <= 45 else 'Senior'
        for age in df[age_column]
    ]
    return df

In [9]:
# Create a df:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45]
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [10]:
df = categorize_age_groups(df, 'Age')
df

      Name  Age Age_Group
0    Alice   25     Youth
1      Bob   30     Adult
2  Charlie   35     Adult
3    David   40     Adult
4      Eve   45     Adult